
## Plan Result (static.cube-unit.net)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/16531149587)


<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * aws_cloudfront_distribution.s3_distribution
  * aws_cloudfront_origin_access_control.s3_distribution
  * aws_s3_bucket_policy.policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::static.cube-unit.net",
              + "arn:aws:s3:::static.cube-unit.net/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::158677943024:distribution/EVP5RFBESZVQY",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EVP5RFBESZVQY"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ target_origin_id           = "static.cube-unit.net.s3.amazonaws.com" -> "static.cube-unit.net.s3-ap-northeast-1.amazonaws.com"
            # (15 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "static.cube-unit.net.s3.amazonaws.com" -> null
          - origin_access_control_id = "E1TL7W1P3M1RQJ" -> null
          - origin_id                = "static.cube-unit.net.s3.amazonaws.com" -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "static.cube-unit.net.s3-ap-northeast-1.amazonaws.com"
          + origin_access_control_id = "E1TL7W1P3M1RQJ"
          + origin_id                = "static.cube-unit.net.s3-ap-northeast-1.amazonaws.com"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_origin_access_control" "s3_distribution" {
        id                                = "E1TL7W1P3M1RQJ"
      ~ name                              = "static.cube-unit.net.s3.amazonaws.com" -> "static.cube-unit.net.s3-ap-northeast-1.amazonaws.com"
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "policy" {
        id     = "static.cube-unit.net"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::158677943024:distribution/EVP5RFBESZVQY"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::static.cube-unit.net/*",
                          - "arn:aws:s3:::static.cube-unit.net",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"f67392bf60d6b316d281bbea34aad6d039071a37","Target":"static.cube-unit.net","Vars":{},"WorkflowName":"terraform-pull-request"} -->